<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'ऐट्रब्यूट  को स्वीकार किया जाना चाहिए।',
    'active_url' => 'ऐट्रब्यूट एक मान्य URL नहीं है।',
    'after' => 'ऐट्रब्यूट की तारीख :date के बाद होनी चाहिए।',
    'after_or_equal' => 'ऐट्रब्यूट की तारीख :date के बाद या समान होनी चाहिए।',
    'alpha' => 'ऐट्रब्यूट में केवल अक्षर होने चाहिए।',
    'alpha_dash' => 'ऐट्रब्यूट में केवल अक्षर, अंक, डैश और अंडरस्कोर होने चाहिए।',
    'alpha_num' => 'ऐट्रब्यूट में केवल अक्षर और अंक होने चाहिए।',
    'array' => 'ऐट्रब्यूट एक एरे होना चाहिए।',
    'before' => 'ऐट्रब्यूट की तारीख :date के पहले होनी चाहिए।',
    'before_or_equal' => 'ऐट्रब्यूट की तारीख :date के पहले या समान होनी चाहिए।',
    'between' => [
        'numeric' => 'ऐट्रब्यूट :min और :मैक्स के बीच होना चाहिए।',
        'file' => 'ऐट्रब्यूट :min और :मैक्स किलोबाइट के बीच होना चाहिए।',
        'string' => 'ऐट्रब्यूट :min और :मैक्स अक्षरों के बीच होना चाहिए।',
        'array' => 'ऐट्रब्यूट में :min और :मैक्स आइटम होने चाहिए।',
    ],
    'boolean' => 'ऐट्रब्यूट फ़ील्ड को सत्य या असत्य होना चाहिए।',
    'confirmed' => 'ऐट्रब्यूट की पुष्टि मेल नहीं खाती।',
    'date' => 'ऐट्रब्यूट एक मान्य तारीख नहीं है।',
    'date_equals' => 'ऐट्रब्यूट की तारीख :date के समान होनी चाहिए।',
    'date_format' => 'ऐट्रब्यूट प्रारूप :format से मेल नहीं खाता।',
    'different' => 'ऐट्रब्यूट और :other अलग होना चाहिए।',
    'digits' => 'ऐट्रब्यूट :digits अंक होना चाहिए।',
    'digits_between' => 'ऐट्रब्यूट :min और :मैक्स अंकों के बीच होना चाहिए।',
    'dimensions' => 'ऐट्रब्यूट की छवि के आयाम अमान्य हैं।',
    'distinct' => 'ऐट्रब्यूट फ़ील्ड में एक डुप्लिकेट मान है।',
    'email' => 'ऐट्रब्यूट एक मान्य ईमेल पता होना चाहिए।',
    'ends_with' => 'ऐट्रब्यूट में निम्नलिखित में से एक के साथ समाप्त होना चाहिए: :वैल्यूs।',
    'exists' => 'चुना गया :attribute अमान्य है।',
    'file' => 'ऐट्रब्यूट एक फ़ाइल होना चाहिए।',
    'filled' => 'ऐट्रब्यूट फ़ील्ड में एक मान होना चाहिए।',
    'gt' => [
        'numeric' => 'ऐट्रब्यूट :वैल्यू से बड़ा होना चाहिए।',
        'file' => 'ऐट्रब्यूट :वैल्यू किलोबाइट से बड़ा होना चाहिए।',
        'string' => 'ऐट्रब्यूट :वैल्यू अक्षरों से बड़ा होना चाहिए।',
        'array' => 'ऐट्रब्यूट में :वैल्यू से अधिक आइटम होने चाहिए।',
    ],
    'gte' => [
        'numeric' => 'ऐट्रब्यूट :वैल्यू से बड़ा या समान होना चाहिए।',
        'file' => 'ऐट्रब्यूट :वैल्यू किलोबाइट से बड़ा या समान होना चाहिए।',
        'string' => 'ऐट्रब्यूट :वैल्यू अक्षरों से बड़ा या समान होना चाहिए।',
        'array' => 'ऐट्रब्यूट में :वैल्यू या अधिक आइटम होने चाहिए।',
    ],
    'image' => 'ऐट्रब्यूट एक छवि होना चाहिए।',
    'in' => 'चुना गया :attribute अमान्य है।',
    'in_array' => 'ऐट्रब्यूट फ़ील्ड :other में मौजूद नहीं है।',
    'integer' => 'ऐट्रब्यूट एक पूर्णांक होना चाहिए।',
    'ip' => 'ऐट्रब्यूट एक मान्य IP पता होना चाहिए।',
    'ipv4' => 'ऐट्रब्यूट एक मान्य IPv4 पता होना चाहिए।',
    'ipv6' => 'ऐट्रब्यूट एक मान्य IPv6 पता होना चाहिए।',
    'json' => 'ऐट्रब्यूट एक मान्य JSON स्ट्रिंग होना चाहिए।',
    'lt' => [
        'numeric' => 'ऐट्रब्यूट :वैल्यू से कम होना चाहिए।',
        'file' => 'ऐट्रब्यूट :वैल्यू किलोबाइट से कम होना चाहिए।',
        'string' => 'ऐट्रब्यूट :वैल्यू अक्षरों से कम होना चाहिए।',
        'array' => 'ऐट्रब्यूट में :वैल्यू  से कम आइटम होने चाहिए।',
    ],
    'lte' => [
        'numeric' => 'ऐट्रब्यूट :वैल्यू से कम या समान होना चाहिए।',
        'file' => 'ऐट्रब्यूट :वैल्यू किलोबाइट से कम या समान होना चाहिए।',
        'string' => 'ऐट्रब्यूट :वैल्यू अक्षरों से कम या समान होना चाहिए।',
        'array' => 'ऐट्रब्यूट में :वैल्यू से अधिक आइटम नहीं होने चाहिए।',
    ],
    'max' => [
        'numeric' => 'ऐट्रब्यूट :मैक्स  से अधिक नहीं होना चाहिए।',
        'file' => 'ऐट्रब्यूट :मैक्स किलोबाइट से अधिक नहीं होना चाहिए।',
        'string' => 'ऐट्रब्यूट :मैक्स अक्षरों से अधिक नहीं होना चाहिए।',
        'array' => 'ऐट्रब्यूट में :मैक्स से अधिक आइटम नहीं होने चाहिए।',
    ],
    'mimes' => 'ऐट्रब्यूट प्रकार की फ़ाइल होनी चाहिए: :वैल्यूs।',
    'mimetypes' => 'ऐट्रब्यूट प्रकार की फ़ाइल होनी चाहिए: :वैल्यूs।',
    'min' => [
        'numeric' => 'ऐट्रब्यूट कम से कम :min होना चाहिए।',
        'file' => 'ऐट्रब्यूट कम से कम :min किलोबाइट होना चाहिए।',
        'string' => 'ऐट्रब्यूट कम से कम :min अक्षर होना चाहिए।',
        'array' => 'ऐट्रब्यूट में कम से कम :min आइटम होने चाहिए।',
    ],
    'multiple_of' => 'ऐट्रब्यूट :वैल्यू का गुणांक होना चाहिए।',
    'not_in' => 'चुना गया :ऐट्रब्यूट अमान्य है।',
    'not_regex' => 'ऐट्रब्यूट प्रारूप अमान्य है।',
    'numeric' => 'ऐट्रब्यूट एक संख्या होना चाहिए।',
    'password' => 'पासवर्ड गलत है।',
    'present' => 'ऐट्रब्यूट फ़ील्ड उपस्थित होना चाहिए।',
    'regex' => 'ऐट्रब्यूट प्रारूप अमान्य है।',
    'required' => 'ऐट्रब्यूट फ़ील्ड आवश्यक है।',
    'required_if' => 'ऐट्रब्यूट फ़ील्ड तब आवश्यक है जब :other :वैल्यू हो।',
    'required_unless' => 'ऐट्रब्यूट फ़ील्ड आवश्यक है जब तक :other :वैल्यूs में न हो।',
    'required_with' => 'ऐट्रब्यूट फ़ील्ड आवश्यक है जब :वैल्यूs उपस्थित हो।',
    'required_with_all' => 'ऐट्रब्यूट फ़ील्ड आवश्यक है जब :वैल्यूs उपस्थित हों।',
    'required_without' => 'ऐट्रब्यूट फ़ील्ड आवश्यक है जब :वैल्यूs उपस्थित न हो।',
    'required_without_all' => 'ऐट्रब्यूट फ़ील्ड आवश्यक है जब :वैल्यूs में से कोई भी उपस्थित न हो।',
    'prohibited' => 'ऐट्रब्यूट फ़ील्ड निषिद्ध है।',
    'prohibited_if' => 'ऐट्रब्यूट फ़ील्ड तब निषिद्ध है जब :other :वैल्यू हो।',
    'prohibited_unless' => 'ऐट्रब्यूट फ़ील्ड निषिद्ध है जब तक :other :वैल्यूs में न हो।',
    'same' => 'ऐट्रब्यूट और :other मेल खाना चाहिए।',
    'size' => [
        'numeric' => 'ऐट्रब्यूट :size होना चाहिए।',
        'file' => 'ऐट्रब्यूट :size किलोबाइट होना चाहिए।',
        'string' => 'ऐट्रब्यूट :size अक्षर होना चाहिए।',
        'array' => 'ऐट्रब्यूट में :size आइटम होने चाहिए।',
    ],
    'starts_with' => 'ऐट्रब्यूट निम्नलिखित में से एक के साथ शुरू होना चाहिए: :वैल्यूs।',
    'string' => 'ऐट्रब्यूट एक स्ट्रिंग होना चाहिए।',
    'timezone' => 'ऐट्रब्यूट एक मान्य क्षेत्र होना चाहिए।',
    'unique' => 'ऐट्रब्यूट पहले से लिया जा चुका है।',
    'uploaded' => 'ऐट्रब्यूट अपलोड करने में विफल रहा।',
    'url' => 'ऐट्रब्यूट प्रारूप अमान्य है।',
    'uuid' => 'ऐट्रब्यूट एक मान्य UUID होना चाहिए।',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'कस्टम संदेश',
        ],

        //doctor opd charge keys
        'doctor_id' => [
            'unique' => 'डॉक्टर का नाम पहले ही लिया जा चुका है।',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
